DataProcessors/РабочееМестоРаботыСЗаказами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоРаботыСЗаказами</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЗаказыПокупателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыПоставщикам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусОплатыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусОплатыЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОплатыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыЗаказовПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказовПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусОплатыЗаказовПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусОплатыЗаказовПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОплатыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийКомплектацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийКомплектацияНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разукомплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыСписанияОстаткаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыСписанияОстаткаТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРезерва</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОприходован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РабочееМестоРаботыСЗаказами/Forms/Форма/Ext/Form/Module.bsl
// Хранит дерево документов на сервере.
&НаСервере
Перем мДерево;

// Хранит соответствие документов и признак присутствия в списке на сервере.
&НаСервере
Перем мУжеВСписке;

// Хранит соответствие имени документов и их метаданных на сервере.
&НаСервере
Перем мКэшРеквизитовДокумента;

&НаСервере
Перем мКэшПраваДоступаКМетаданным;


&НаКлиенте
Процедура ЗаказыПокупателейПриАктивизацииСтроки(Элемент)
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ссылка;
	Исключение
		ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
	КонецПопытки;

	
	УстановитьОтборДинамическогоСписка(ДокументСсылка);
	ЗаполнитьТаблицуСоставаЗаказа(ДокументСсылка);
	ВывестиСтруктуруПодчиненности();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСоставаЗаказа(мЗаказПокупателя)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателяТовары.НомерСтроки,
	               |	ЗаказПокупателяТовары.Номенклатура,
	               |	ЗаказПокупателяТовары.Количество,
	               |	ЗаказПокупателяТовары.Цена,
	               |	ЗаказПокупателяТовары.Сумма,
	               |	ЗаказПокупателяТовары.УникальныйИдентификаторСтроки,
	               |	ЗаказПокупателяТовары.Размещение,
	               |	СтатусыЗаказов.Статус КАК СтатусСтроки,
	               |	СтатусОплатыЗаказов.Статус КАК СтатусОплаты
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	               |		ПО ЗаказПокупателяТовары.УникальныйИдентификаторСтроки = СтатусыЗаказов.УникальныйИдентификаторСтроки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусОплатыЗаказов КАК СтатусОплатыЗаказов
	               |		ПО ЗаказПокупателяТовары.УникальныйИдентификаторСтроки = СтатусОплатыЗаказов.УникальныйИдентификаторСтроки
	               |ГДЕ
	               |	ЗаказПокупателяТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",мЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТоварыЗаказаПокупателя.Загрузить(РезультатЗапроса);
	
	//Для Каждого стрЗакза из ТоварыЗаказаПокупателя Цикл 
	//	
	//	стрЗакза.СтатусСтроки = ПолучитьСтатусЗаказа(стрЗакза.УникальныйИдентификаторСтроки, стрЗакза.Номенклатура, мЗаказПокупателя);

	//	стрЗакза.СтатусОплаты = ПолучитьСтатусОплаты(стрЗакза.УникальныйИдентификаторСтроки, стрЗакза.Номенклатура, мЗаказПокупателя);
	//	
	//	//Сообщить(Строка(ПолучитьСтатусЗаказа(стрЗакза.УникальныйИдентификаторСтроки, стрЗакза.Номенклатура, мЗаказПокупателя)));
	//	//Сообщить(стрЗакза.СтатусСтроки);
	//	//Сообщить(ТипЗнч(стрЗакза.СтатусСтроки));	
	//	
	//КонецЦикла;
	//
	Элементы.ТоварыЗаказа.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(мЗаказПокупателя)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателяТовары.НомерСтроки,
	               |	ЗаказПокупателяТовары.Номенклатура,
	               |	ЗаказПокупателяТовары.Количество,
	               |	ЗаказПокупателяТовары.Цена,
	               |	ЗаказПокупателяТовары.Сумма,
	               |	ЗаказПокупателяТовары.УникальныйИдентификаторСтроки
	               |ИЗ
	               |	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |ГДЕ
	               |	ЗаказПокупателяТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",мЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЗаказыПоставщикам.Отбор.Элементы.Очистить();
	
	ЗапросПоЗаказамПоставщику = Новый Запрос;
	ЗапросПоЗаказамПоставщику.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.УникальныйИдентификаторСтроки В(&УникальныйИдентификаторСтроки)
	|	И ЗаказПоставщикуТовары.УникальныйИдентификаторСтроки <> """"";
	ЗапросПоЗаказамПоставщику.УстановитьПараметр("УникальныйИдентификаторСтроки",РезультатЗапроса.ВыгрузитьКолонку("УникальныйИдентификаторСтроки"));
	
	РезультатЗапросаПоЗаказамПоставщику = ЗапросПоЗаказамПоставщику.Выполнить().Выгрузить();
	
	Если РезультатЗапросаПоЗаказамПоставщику.Количество() > 0 Тогда 
		
		ТоварыЗаказаПокупателя.Загрузить(РезультатЗапроса);
		НовЭлементОтбора 			    = ЗаказыПоставщикам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ссылка"); 
		НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		НовЭлементОтбора.Использование  = Истина;
		НовЭлементОтбора.ПравоеЗначение = РезультатЗапросаПоЗаказамПоставщику.ВыгрузитьКолонку("Ссылка");
	Иначе
		
		НовЭлементОтбора 			    = ЗаказыПоставщикам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ссылка"); 
		НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		НовЭлементОтбора.Использование  = Истина;
		НовЭлементОтбора.ПравоеЗначение = Документы.ЗаказПоставщику.ПустаяСсылка();
		
	КонецЕсли;
	
	КонецПроцедуры
	
&НаСервере
Функция ПолучитьСтатусЗаказа(УидСтроки, Номенклатура, Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗаказов.Номенклатура,
		|	СтатусыЗаказов.УникальныйИдентификаторСтроки КАК УникальныйИдентификаторСтроки,
		|	СтатусыЗаказов.Статус КАК СтатусЗаказа
		|ИЗ
		|	РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
		|ГДЕ
		|	СтатусыЗаказов.ЗаказПокупателя = &Ссылка
		|	И СтатусыЗаказов.Номенклатура = &Номенклатура
		|	И СтатусыЗаказов.УникальныйИдентификаторСтроки = &УникальныйИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("УникальныйИдентификаторСтроки", УидСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.СтатусЗаказа;
		
	КонецЦикла;

КонецФункции

&НаСервере
Функция ПолучитьСтатусОплаты(УидСтроки, Номенклатура, Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусОплатыЗаказов.Номенклатура,
		|	СтатусОплатыЗаказов.УникальныйИдентификаторСтроки КАК УникальныйИдентификаторСтроки,
		|	СтатусОплатыЗаказов.Статус КАК СтатусОплаты
		|ИЗ
		|	РегистрСведений.СтатусОплатыЗаказов КАК СтатусОплатыЗаказов
		|ГДЕ
		|	СтатусОплатыЗаказов.ЗаказПокупателя = &Ссылка
		|	И СтатусОплатыЗаказов.Номенклатура = &Номенклатура
		|	И СтатусОплатыЗаказов.УникальныйИдентификаторСтроки = &УникальныйИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("УникальныйИдентификаторСтроки", УидСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.СтатусОплаты;
		
	КонецЦикла;

КонецФункции

&НаКлиенте
Процедура ЗаказыПоставщикамПриАктивизацииСтроки(Элемент)
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ссылка;
	Исключение
		ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
	КонецПопытки;

	
	ЗаполнитьТаблицуСоставаЗаказаПоставщику(ДокументСсылка);
	
	Если не Элементы.ЗаказыПокупателей.Видимость Тогда 
			ВывестиСтруктуруПодчиненности();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСоставаЗаказаПоставщику(ссылка)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.НомерСтроки,
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	ЗаказПоставщикуТовары.Количество,
	               |	ЗаказПоставщикуТовары.Цена,
	               |	ЗаказПоставщикуТовары.Сумма,
	               |	ЗаказПоставщикуТовары.УникальныйИдентификаторСтроки,
	               |	МАКСИМУМ(СтатусыЗаказовПоставщику.Статус) КАК СтатусСтроки,
	               |	МАКСИМУМ(СтатусОплатыЗаказовПоставщику.Статус) КАК СтатусОплаты
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказовПоставщику КАК СтатусыЗаказовПоставщику
	               |		ПО ЗаказПоставщикуТовары.УникальныйИдентификаторСтроки = СтатусыЗаказовПоставщику.УникальныйИдентификаторСтроки
	               |			И (ЗаказПоставщикуТовары.УникальныйИдентификаторСтроки <> """")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусОплатыЗаказовПоставщику КАК СтатусОплатыЗаказовПоставщику
	               |		ПО ЗаказПоставщикуТовары.Ссылка = СтатусОплатыЗаказовПоставщику.ЗаказПоставщика
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	ЗаказПоставщикуТовары.УникальныйИдентификаторСтроки,
	               |	ЗаказПоставщикуТовары.Сумма,
	               |	ЗаказПоставщикуТовары.Цена,
	               |	ЗаказПоставщикуТовары.Количество,
	               |	ЗаказПоставщикуТовары.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка",ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//Для Каждого Строка из РезультатЗапроса Цикл 
	//	
	//	Строка.СтатусСтроки = ПолучитьСтатусЗаказа(Строка.УникальныйИдентификаторСтроки, Строка.Номенклатура, Ссылка);

	//	Строка.СтатусОплаты = ПолучитьСтатусОплаты(Строка.УникальныйИдентификаторСтроки, Строка.Номенклатура, Ссылка);
	//	
	//КонецЦикла;
	
	ТоварыЗаказаПоставщику.Загрузить(РезультатЗапроса);
	
КонецПроцедуры



/////////////////////////////////////////Структура подчинености////////////////////////////////
&НаКлиенте
Процедура ВывестиСтруктуруПодчиненности()
	
	
	Если ДокументСсылка = Неопределено 
		Или ДокументСсылка.Пустая() Тогда
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеДереваДокументов();

	КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбновлениеДереваДокументов()
	
	ВывестиДеревоДокументов();
	РазвернутьТаблицуДокументов();
		
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьТаблицуДокументов()

	ЭлементыДерева = ДеревоДокументов.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл

		Элементы.ДеревоДокументов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);

	КонецЦикла;

КонецПроцедуры


&НаСервере
Процедура ВывестиДеревоДокументов()
	
	ДанныеДерева = ДеревоДокументов.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	мДерево = ДанныеДерева;	
	мУжеВСписке.Очистить();
	ВывестиРодительскиеДокументы(ДокументСсылка);
	
	ВывестиПодчиненныеДокументы(мДерево, мКэшПраваДоступаКМетаданным);
	ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка);
	
	//ВывестиДокументыОплатыПлатежныхПозиций(ДанныеДерева);
	
КонецПроцедуры // ВывестиДеревоДокументов()

// бит_DKravchenko Процедура устанавливает индекс пиктограммы текущего состояния документа на сервере.
//
// Параметры:
//  ДанныеТекущейСтроки - ДанныеФормыЭлементДерева.
//
&НаСервереБезКонтекста 
Процедура УстановитьИндексПиктограммыСостоянияДокументаСервер(ДанныеТекущейСтроки)
	
	// Установим индекс пиктограммы текущего состояния документа:
	// 0 - Проведен
	// 1 - помечен на удаление
	// 2 - непроведен
	
	Если ДанныеТекущейСтроки.Проведен Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 0;
		
	ИначеЕсли ДанныеТекущейСтроки.ПометкаУдаления Тогда
		ДанныеТекущейСтроки.ИндексПиктограммы = 1;
		
	Иначе
		ДанныеТекущейСтроки.ИндексПиктограммы = 2;
	КонецЕсли;
	
КонецПроцедуры


// бит_ASubbotina Функция получает имя табличной части документа - родителя, в которой нужно искать текущий документ
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка
//  
// Возвращаемое значение:
//   Строка
//
&НаСервере
Функция ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка)

			ИмяТабЧастиРодителя = Неопределено;	
		
	
	Возврат ИмяТабЧастиРодителя;
	
КонецФункции // ПолучитьИмяТабличнойЧастиДляПоискаРодителя()

// бит_ASubbotina Функция добавляет элементы в список документов 
//
// Параметры:
//  СписокРеквизитов     	- СписокЗначений
//  МетаданныеДокумента  	- ОбъектМетаданных
//  МетаданныеДокументы  	- КоллекцияОбъектовМетаданных
//  мКэшМетаданныеРеквизита - Соответствие
//
&НаСервере
Процедура ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита)

	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = мКэшМетаданныеРеквизита.Получить(ТекущийТип);
			Если МетаданныеРеквизита = неопределено Тогда
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				мКэшМетаданныеРеквизита.Вставить(ТекущийТип,МетаданныеРеквизита);
			КонецЕсли;
					
			Если МетаданныеРеквизита<>Неопределено 
				 И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
				 И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						 ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры // ДополнитьСписокДокументовПоРеквизитам()

// бит_ASubbotina Функция добавляет элементы в список документов из табличных частей
//
// Параметры:
//  СписокРеквизитов     - СписокЗначений
//  МетаданныеДокумента  - ОбъектМетаданных
//  МетаданныеДокументы  - КоллекцияОбъектовМетаданных
//
&НаСервере
Процедура ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы)

	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);				
				Если МетаданныеРеквизита<>Неопределено И МетаданныеДокументы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;						
			КонецЦикла;
		КонецЦикла;
		
		Попытка
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Исключение
		КонецПопытки;
		
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И МетаданныеДокументы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЦикла;
			
КонецПроцедуры // ДополнитьСписокДокументовПоТабличнымЧастям()

// бит_ASubbotina Функция добавляет элементы в список документов 
//
// Параметры:
//  СписокРеквизитов     	- СписокЗначений
//  ДокументСсылка          - ДокументСсылка
//  ИмяТабЧастиРодителя  	- Строка
//
&НаСервере
Процедура ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя)

	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДопУсловияПоДоговоруТч.Ссылка,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Проведен,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ПометкаУдаления,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.Представление,
	|	бит_ДопУсловияПоДоговоруТч.Ссылка.ВалютаДокумента,
	|	NULL КАК СуммаДокумента
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору." + ИмяТабЧастиРодителя + " КАК бит_ДопУсловияПоДоговоруТч
	|ГДЕ
	|	бит_ДопУсловияПоДоговоруТч.ДокументПланирования = &ДокументПланирования
	|";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СсылкаНаДокумент = Выборка.Ссылка;
		ВывестиРодительскиеДокументы(СсылкаНаДокумент);
				
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСтрокуРодителя()

// Процедура выполняет вывод родительских документов.
//
&НаСервере
Процедура ВывестиРодительскиеДокументы(ДокументСсылка)
	
	МетаданныеДокумента 	= ДокументСсылка.Метаданные();
	СписокРеквизитов 		= Новый СписокЗначений;
	МетаданныеДокументы 	= Метаданные.Документы; 
	мКэшМетаданныеРеквизита = Новый соответствие;
	
	РеквизитыТчПодчинённые = Ложь;
	ИмяТабЧастиРодителя    = ПолучитьИмяТабличнойЧастиДляПоискаРодителя(ДокументСсылка);
	
	ДополнитьСписокДокументовПоРеквизитам(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы, мКэшМетаданныеРеквизита);
	Если Не РеквизитыТчПодчинённые Тогда 		
		ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);		
	КонецЕсли; // если надо выводить реквизиты табличной части в качестве родителей
	Если СписокРеквизитов.Количество() = 0 И ИмяТабЧастиРодителя <> Неопределено Тогда
		ДобавитьСтрокуРодителя(СписокРеквизитов, ДокументСсылка, ИмяТабЧастиРодителя);	
	КонецЕсли;
		
	СписокРеквизитов.СортироватьПоПредставлению();
	мУжеВСписке.Вставить(ДокументСсылка, Истина);
	
	Если СписокРеквизитов.Количество() = 1 Тогда
		ВывестиРодительскиеДокументы(СписокРеквизитов[0].Значение);
	ИначеЕсли СписокРеквизитов.Количество() > 1 Тогда
		ВывестиБезРодителей(СписокРеквизитов);		
	КонецЕсли;

	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокаДерева = мДерево.ПолучитьЭлементы().Добавить();
	Иначе
		СтрокаДерева = мДерево.Добавить();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
						   | ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
						   
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
	КонецЕсли;
	
	Выборка  = Запрос.Выполнить().Выбрать();
	ЕСли Выборка.Следующий() Тогда		
		
		СтрокаДерева.Ссылка   		 = Выборка.Ссылка;
		СтрокаДерева.Проведен 		 = Выборка.Проведен;
		СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
		
		// Установим индекс пиктограммы текущего состояния документа.
		УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
		
		СтрокаДерева.ДокументПредставление = Выборка.Представление;
		СтрокаДерева.СуммаДокумента  = Выборка.СуммаДокумента;
		СтрокаДерева.ВалютаДокумента = Выборка.ВалютаДокумента;
		
	Иначе
		
		СтрокаДерева.Ссылка= ДокументСсылка;
		СтрокаДерева.ДокументПредставление = Строка(ДокументСсылка);
		СтрокаДерева.СуммаДокумента 	   = ДокументСсылка.СуммаДокумента;
		
	КонецЕсли;
	
	мДерево = СтрокаДерева;
		
КонецПроцедуры // ВывестиРодительскиеДокументы()

// Процедура осуществляет вывод родительских документов с ограничением по уровню в дереве.
//
&НаСервере
Процедура ВывестиБезРодителей(СписокДокументов, ВывестиПодчиненные = Ложь)
	
	Если ТипЗнч(мДерево) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = мДерево.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = мДерево;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДокументов Цикл
		
		МетаданныеДокумента = ЭлементСписка.Значение.Метаданные();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка, Проведен, ПометкаУдаления, #Сумма, #Валюта, Представление, """ + МетаданныеДокумента.Имя + """ КАК Метаданные
		| ИЗ Документ."+МетаданныеДокумента.Имя + " ГДЕ Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементСписка.Значение);
		
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "СуммаДокумента КАК СуммаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Сумма", "NULL КАК СуммаДокумента");
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "ВалютаДокумента КАК ВалютаДокумента");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Валюта", "NULL КАК ВалютаДокумента");
		КонецЕсли;
		
		Выборка  = Запрос.Выполнить().Выбрать();
		ЕСли Выборка.Следующий() Тогда		
			
			Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
				
	            СтрокаДерева = СтрокиДерева.Добавить();
				СтрокаДерева.Ссылка= Выборка.Ссылка;
				СтрокаДерева.Проведен = Выборка.Проведен;
				СтрокаДерева.ПометкаУдаления = Выборка.ПометкаУдаления;
				
				// Установим индекс пиктограммы текущего состояния документа.
				УстановитьИндексПиктограммыСостоянияДокументаСервер(СтрокаДерева);
				
				СтрокаДерева.ДокументПредставление = Выборка.Представление;
				СтрокаДерева.СуммаДокумента 	   = Выборка.СуммаДокумента;
				СтрокаДерева.ВалютаДокумента 	   = Выборка.ВалютаДокумента;
				мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
				
				Если ВывестиПодчиненные Тогда
					ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;

	мДерево = СтрокаДерева;
	
КонецПроцедуры // ВывестиБезРодителей()

// Процедура осуществляет вывод подчиненных документов.
//
&НаСервере
Процедура ВывестиПодчиненныеДокументы(СтрокаДерева, мКэшПраваДоступаКМетаданным)
	
	ТекущийДокумент = СтрокаДерева.Ссылка;	
	// бит_DKravchenko изменение кода. Начало. 15.01.2010{{ 
	Таблица = ПолучитьСписокПодчиненныхДокументов(ТекущийДокумент, мКэшПраваДоступаКМетаданным);
	// бит_DKravchenko изменение кода. Конец. 15.01.2010}} 
	КэшПоТипамДокументов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;			
		ИмяДокумента = МетаданныеДокумента.Имя;
		СинонимДокумента = МетаданныеДокумента.Синоним;
		
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента);
		
		СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
		Если СтруктураТипа = Неопределено Тогда
			СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
			КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
		КонецЕсли;
		СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);		
	КонецЦикла;
	
	Если КэшПоТипамДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";
	Запрос = Новый Запрос;
	Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
					|ВЫБРАТЬ ", "
					|ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ") + "
					|Дата, Ссылка, Представление, Проведен, ПометкаУдаления, 
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"], "СуммаДокумента", "NULL") + " КАК СуммаДокумента,
					|" + ?(мКэшРеквизитовДокумента[КлючИЗначение.Ключ]["ВалютаДокумента"], "ВалютаДокумента", "NULL") + " КАК ВалютаДокумента
					|ИЗ Документ." + КлючИЗначение.Ключ + "
					|ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
					
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = СтрокаДерева;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
			
			НоваяСтрока = СтрокиДерева.Добавить();
			НоваяСтрока.Ссылка 				  = Выборка.Ссылка;
			НоваяСтрока.ДокументПредставление = Выборка.Представление;
			НоваяСтрока.СуммаДокумента 		  = Выборка.СуммаДокумента;
			НоваяСтрока.ВалютаДокумента 	  = Выборка.ВалютаДокумента;
			НоваяСтрока.Проведен 			  = Выборка.Проведен;
			НоваяСтрока.ПометкаУдаления 	  = Выборка.ПометкаУдаления;		
			
			// Установим индекс пиктограммы текущего состояния документа.
			УстановитьИндексПиктограммыСостоянияДокументаСервер(НоваяСтрока);
			
			мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
			ВывестиПодчиненныеДокументы(НоваяСтрока,мКэшПраваДоступаКМетаданным);
			
			ТемпДерево = мДерево;
			мДерево    = НоваяСтрока;
			ВывестиПодчинённыеИзТабличныхЧастей(НоваяСтрока.Ссылка);
			мДерево = ТемпДерево;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиПодчиненныеДокументы()

&НаСервере
Процедура ВывестиПодчинённыеИзТабличныхЧастей(ДокументСсылка)

	РеквизитыТчПодчинённые = Ложь;
		
	Если Не РеквизитыТчПодчинённые Тогда
		Возврат;
	КонецЕсли;
		
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов 	= Новый СписокЗначений;
	МетаданныеДокументы = Метаданные.Документы;
	
	ДополнитьСписокДокументовПоТабличнымЧастям(СписокРеквизитов, ДокументСсылка, МетаданныеДокумента, МетаданныеДокументы);
    ВывестиБезРодителей(СписокРеквизитов, Истина);

КонецПроцедуры // ВывестиПодчинённыеИзТабличныхЧастей()

Функция ПолучитьСписокПодчиненныхДокументов(ДокументОснование, мКэшПраваДоступаКМетаданным, ИмяКритерия = "СвязанныеДокументы") Экспорт
		
	ТекстЗапроса = "";
	
	ТаблицаДокументов 	 = Новый ТаблицаЗначений;
	ТипДокументОснование = ТипЗнч(ДокументОснование);
	СоставКритерия		 = Метаданные.КритерииОтбора[ИмяКритерия].Состав;
	
	Для Каждого ЭлементСостава ИЗ СоставКритерия Цикл
		
		Если Не ЭлементСостава.Тип.СодержитТип(ТипДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным
																				   ,мКэшПраваДоступаКМетаданным);
		Если Не СтруктураПутьКДанным.ЕстьДоступКМетаданным Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." 
						   + СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ 		 = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
					   |ВЫБРАТЬ") + "
					   |" + СтруктураПутьКДанным.ВидОбъекта   + ".Ссылка ИЗ " + ИмяОбъекта 						+ "."
					      + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " 	  + СтруктураПутьКДанным.ВидОбъекта + "
					   |" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
					   |";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТаблицаДокументов = РезультатЗапроса.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПолучитьСписокПодчиненныхДокументов()

Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным, мКэшПраваДоступаКМетаданным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	ЕстьДоступКМетаданным = мКэшПраваДоступаКМетаданным.Получить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта);
	Если ЕстьДоступКМетаданным = неопределено Тогда
		Если Структура.ТипОбъекта = "Документ" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Документы[Структура.ВидОбъекта]);
		ИначеЕсли Структура.ТипОбъекта = "Задача" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Задачи[Структура.ВидОбъекта]);
		Иначе
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Справочники[Структура.ВидОбъекта]);
		КонецЕсли;
	КонецЕсли;                                                          
	
	Структура.Вставить("ЕстьДоступКМетаданным", ЕстьДоступКМетаданным);
	мКэшПраваДоступаКМетаданным.Вставить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта,ЕстьДоступКМетаданным);        
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

&НаСервереБезКонтекста
Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента, мКэшРеквизитовДокумента)
	
	РеквизитыДокумента = мКэшРеквизитовДокумента[ИмяДокумента];
	
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;		
		РеквизитыДокумента.Вставить("СуммаДокумента" , МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента")  <> Неопределено);
		РеквизитыДокумента.Вставить("ВалютаДокумента", МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено);		
		
		мКэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварами(Команда)
	
	Попытка
		
		ДокументСсылка = Элементы.ЗаказыПокупателей.ТекущиеДанные.ссылка;
		ПараметрыЗаказы = новый Структура("ЗаказПокупателя",ДокументСсылка);
		
		Форма = ПолучитьФорму("Обработка.ЗаполнениеДокументаЗаказПокупателя.Форма.Форма",ПараметрыЗаказы);
    	Обработка = Форма.ОбработкаОбъект;
    	Обработка.СсылкаНаОбъект = ДокументСсылка;
		Форма.ОткрытьМодально();
		
	Исключение
		ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
	КонецПопытки;

	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКомплектацию(Команда)
	ДокументСсылка = Элементы.ЗаказыПокупателей.ТекущиеДанные.ссылка;

	
	
	Если НЕ МожноСоздатьКомплектацию(ДокументСсылка) Тогда
		Сообщить("Не все позиции есть на складе");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='Создать документ комплектации?';uk='Створити документ комплектації?'");
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "");
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураПроект = Справочники.Номенклатура.НайтиПоНаименованию(ДокументСсылка.Проект.Наименование, Истина); 
	
	Если ЗначениеЗаполнено(НоменклатураПроект) И НЕ НоменклатураПроект.ЭтоГруппа Тогда
		Сообщить("Не найдена группа " + ДокументСсылка.Проект.Наименование);
		Возврат;
	КонецЕсли;

	
	Для Каждого Элем из ДокументСсылка.ТоварыИКомплектующие.Строки Цикл
		
		ДокОб = Документы.КомплектацияНоменклатуры.СоздатьДокумент();
		ДанныеСтроки = Элем;
		
		ДокОб.Номенклатура 					= СоздатьНоменклатуру(ДанныеСтроки, НоменклатураПроект, Ложь);
		ДокОб.ЕдиницаИзмерения				= ДокОб.Номенклатура.ЕдиницаХраненияОстатков;
		ДокОб.Организация					= ДокументСсылка.Организация;
		ДокОб.Подразделение					= ДокументСсылка.Подразделение;
		ДокОб.Склад							= ДокументСсылка.СкладГруппа;
		ДокОб.ВидОперации					= Перечисления.ВидыОперацийКомплектацияНоменклатуры.Комплектация;
		ДокОб.Заказ							= ДокументСсылка;
		ДокОб.Количество					= ДанныеСтроки.Количество;
		ДокОб.Коэффициент					= ДанныеСтроки.Коэффициент;
		
		Для Каждого стрТовар из Элем.Строки Цикл
			
			НовСтр = ДокОб.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, стрТовар);
			НовСтр.Номенклатура     = ПолучитьНоменклатуру(стрТовар.Номенклатура, стрТовар.УникальныйИдентификаторСтроки ,ДокументСсылка);
			НовСтр.ЕдиницаИзмерения = НовСтр.Номенклатура.ЕдиницаХраненияОстатков;
			
			НовСтр.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
			
		КонецЦикла;
		
		ОткрытьЗначение(ДокОб);
		
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Функция МожноСоздатьКомплектацию(Ссылка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Поле1
		|ИЗ
		|	РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
		|ГДЕ
		|	СтатусыЗаказов.ЗаказПокупателя = &ЗаказПокупателя
		|	И СтатусыЗаказов.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказов.НаСкладе)";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Функция СоздатьНоменклатуру(Данные, грПроект, ЭтоКомплектующее)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование
		|	И Номенклатура.Родитель = &грПроект";
	
	Запрос.УстановитьПараметр("Наименование", Данные.Номенклатура);
	Запрос.УстановитьПараметр("грПроект", грПроект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		СпрОБ 							= Справочники.Номенклатура.СоздатьЭлемент();
		СпрОБ.Родитель 					= грПроект.Ссылка;
		СпрОБ.Наименование 				= Данные.Номенклатура;
		СпрОБ.НаименованиеПолное		= СпрОБ.Наименование;
		
		СпрОБ.ВидНоменклатуры			= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");
		СпрОБ.БазоваяЕдиницаИзмерения	= Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Данные.ЕдиницаИзмерения);
		
		СпрОБ.Записать();
		
		НайденнаяЕдиницаОбъект 							= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НайденнаяЕдиницаОбъект.Наименование            = СокрЛП(СпрОБ.БазоваяЕдиницаИзмерения);
		НайденнаяЕдиницаОбъект.ЕдиницаПоКлассификатору = СпрОБ.БазоваяЕдиницаИзмерения;
		НайденнаяЕдиницаОбъект.Коэффициент             = 1;
		НайденнаяЕдиницаОбъект.Владелец                = СпрОБ.Ссылка;
		НайденнаяЕдиницаОбъект.Записать();
			
		СпрОБ.ЕдиницаХраненияОстатков 	= НайденнаяЕдиницаОбъект.Ссылка;
		СпрОБ.ЕдиницаИзмеренияМест		= НайденнаяЕдиницаОбъект.Ссылка;
		СпрОБ.Записать();
		
	Иначе
		
		СпрОБ = РезультатЗапроса.Выгрузить()[0].Номенклатура;
		
	КонецЕсли;
	
	Возврат СпрОБ.Ссылка;
	
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуру(Номенклатура, УИДСтроки, Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыЗаказов.НоменклатураПоставщика КАК Номенклатура
		|ИЗ
		|	РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
		|ГДЕ
		|	СтатусыЗаказов.ЗаказПокупателя = &ЗаказПокупателя
		|	И СтатусыЗаказов.УникальныйИдентификаторСтроки = &УникальныйИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Заказ);
	Запрос.УстановитьПараметр("УникальныйИдентификаторСтроки", УИДСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Номенклатура;
	
КонецФункции

&НаКлиенте
Процедура ЗаказыПокупателей(Команда)
	Если Элементы.ЗаказыПокупателей.Видимость Тогда 
		
		Элементы.ЗаказыПокупателей.Видимость = Ложь;
		Элементы.ТоварыЗаказа.Видимость      = Ложь;
		ЗаказыПоставщикам.Отбор.Элементы.Очистить();
		
	Иначе
		
		Элементы.ЗаказыПокупателей.Видимость = Истина;
		Элементы.ТоварыЗаказа.Видимость      = Истина;
		
	КонецЕсли;
	Элементы.ФормаЗаказыПокупателей.Пометка = Элементы.ЗаказыПокупателей.Видимость;
	Если Элементы.ФормаМоиЗаказы.Пометка Тогда 
			Если ЗаказыПоставщикам.Отбор.Элементы.Количество() Тогда 
				ЗаказыПоставщикам.Отбор.Элементы.Очистить();
			Иначе
				
				
				
				НовЭлементОтбора 			    =  ЗаказыПоставщикам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Менеджер"); 
				НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
				НовЭлементОтбора.Использование  = Истина;
				НовЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
		КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикам(Команда)
	Если Элементы.ЗаказыПоставщикам.Видимость Тогда 
		
		Элементы.ЗаказыПоставщикам.Видимость = Ложь;
		Элементы.ТоварыЗаказаПоставщику.Видимость      = Ложь;
		
	Иначе
		
		Элементы.ЗаказыПоставщикам.Видимость = Истина;
		Элементы.ТоварыЗаказаПоставщику.Видимость      = Истина;

	КонецЕсли;
	Элементы.ФормаЗаказыПоставщиков.Пометка = Элементы.ЗаказыПоставщикам.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура МоиЗаказы(Команда)
	
	
	Если ЗаказыПокупателей.Отбор.Элементы.Количество() Тогда 
		ЗаказыПокупателей.Отбор.Элементы.Очистить();
	Иначе
		
		
		
		НовЭлементОтбора 			    =  ЗаказыПокупателей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Менеджер"); 
		НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		НовЭлементОтбора.Использование  = Истина;
		НовЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	
	Если ЗаказыПоставщикам.Отбор.Элементы.Количество() Тогда 
		ЗаказыПоставщикам.Отбор.Элементы.Очистить();
	Иначе
		
		
		
		НовЭлементОтбора 			    =  ЗаказыПоставщикам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Менеджер"); 
		НовЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		НовЭлементОтбора.Использование  = Истина;
		НовЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

	
	
	Элементы.ФормаМоиЗаказы.Пометка = ЗаказыПокупателей.Отбор.Элементы.Количество();
	
	Если Элементы.ЗаказыПокупателей.Видимость Тогда 
		ЗаказыПокупателейПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	ЗаказыПоставщикамПриАктивизацииСтроки(Неопределено);

КонецПроцедуры


&НаКлиенте
Процедура ДеревоДокументовПередНачаломИзменения(Элемент, Отказ)	
	Отказ = Истина;
	ОткрытьДокумент();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДокумент()
	
	ДанныеТекущейСтроки = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ДанныеТекущейСтроки.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказыПоставщику(Команда)
	Попытка
		
		ДокументСсылка = Элементы.ЗаказыПокупателей.ТекущиеДанные.ссылка;
		ПараметрыЗаказы = новый Структура("ЗаказПокупателя",ДокументСсылка);
		
		Форма = ПолучитьФорму("Обработка.СоздатьЗаказыПоставщику.Форма.Форма",ПараметрыЗаказы);
    	Обработка = Форма.ОбработкаОбъект;
    	Обработка.СсылкаНаОбъект = ДокументСсылка;
		Форма.Открыть();
		
	Исключение
		ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
	КонецПопытки;

	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаРасходованиеДС(Команда)
	Попытка
		ДокументСсылка = Элементы.ЗаказыПоставщикам.ТекущиеДанные.ссылка;		
	Исключение		
		ДокументСсылка = Документы.ЗаказПоставщику.ПустаяСсылка();		
	КонецПопытки;
	
	
	ДО = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
	ДО.Заполнить(ДокументСсылка);
	ДО.ПолучитьФорму().Открыть();	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаРасходованиеДСНаСервере(Ссылка)

	ДокументЗаявка = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
	ДокументЗаявка.Заполнить(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.ЗаказыПокупателей.Обновить();
	Элементы.ЗаказыПоставщикам.Обновить();
	
	Если не Элементы.ЗаказыПокупателей.Видимость Тогда 
		Попытка
			ДокументСсылка = Элементы.ЗаказыПоставщикам.ТекущиеДанные.ссылка;
		Исключение
			ДокументСсылка = Документы.ЗаказПоставщику.ПустаяСсылка();	
		КонецПопытки;
		
		
		ЗаполнитьТаблицуСоставаЗаказаПоставщику(ДокументСсылка);
		
		Если не Элементы.ЗаказыПокупателей.Видимость Тогда 
			ВывестиСтруктуруПодчиненности();		
		КонецЕсли;
		
	Иначе
		Попытка
			ДокументСсылка = Элементы.ЗаказыПокупателей.ТекущиеДанные.ссылка;
		Исключение
			ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();	
		КонецПопытки;
		
		
		УстановитьОтборДинамическогоСписка(ДокументСсылка);
		ЗаполнитьТаблицуСоставаЗаказа(ДокументСсылка);
		ВывестиСтруктуруПодчиненности();
	КонецЕсли;
	//ВыполнитьОбновлениеДереваДокументов();
	
	
		

КонецПроцедуры



мУжеВСписке 				= Новый Соответствие;
мКэшРеквизитовДокумента 	= Новый Соответствие;
мКэшПраваДоступаКМетаданным	= Новый Соответствие;
